Day-1

In [1]:
import pandas as pd

         Date     Product  Quantity  Price Customer_ID Region  Total_Sales
0  2024-01-01       Phone         7  37300     CUST001   East       261100
1  2024-01-02  Headphones         4  15406     CUST002  North        61624
2  2024-01-03       Phone         2  21746     CUST003   West        43492
3  2024-01-04  Headphones         1  30895     CUST004   East        30895
4  2024-01-05      Laptop         8  39835     CUST005  North       318680

Day-2

In [ ]:
df = pd.read_csv("/Volumes/X/coding/code/internship- the dev arena/sales_data.csv")
df.head()
df.info()
df.shape
df.dtypes
df.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         100 non-null    object
 1   Product      100 non-null    object
 2   Quantity     100 non-null    int64
 3   Price        100 non-null    int64
 4   Customer_ID  100 non-null    object
 5   Region       100 non-null    object
 6   Total_Sales  100 non-null    int64
dtypes: int64(3), object(4)
memory usage: 5.6+ KB

Index(['Date', 'Product', 'Quantity', 'Price', 'Customer_ID', 'Region',
       'Total_Sales'],
      dtype='object')

In [13]:
print(pd.read_csv("/Volumes/X/coding/code/internship- the dev arena/sales_data.csv"))

          Date     Product  Quantity  Price Customer_ID Region  Total_Sales
0   2024-01-01       Phone         7  37300     CUST001   East       261100
1   2024-01-02  Headphones         4  15406     CUST002  North        61624
2   2024-01-03       Phone         2  21746     CUST003   West        43492
3   2024-01-04  Headphones         1  30895     CUST004   East        30895
4   2024-01-05      Laptop         8  39835     CUST005  North       318680
..         ...         ...       ...    ...         ...    ...          ...
95  2024-04-05      Tablet         8  20770     CUST096  North       166160
96  2024-04-06  Headphones         1   7647     CUST097   West         7647
97  2024-04-07      Tablet         5  27196     CUST098   East       135980
98  2024-04-08     Monitor         1  30717     CUST099  North        30717
99  2024-04-09  Headphones         5  23376     CUST100  South       116880

[100 rows x 7 columns]

Day-3

In [3]:
df.isna().sum()

Date           0
Product        0
Quantity       0
Price          0
Customer_ID    0
Region         0
Total_Sales    0
dtype: int64

In [8]:
df.dropna()

          Date     Product  Quantity  Price Customer_ID Region  Total_Sales
0   2024-01-01       Phone         7  37300     CUST001   East       261100
1   2024-01-02  Headphones         4  15406     CUST002  North        61624
2   2024-01-03       Phone         2  21746     CUST003   West        43492
3   2024-01-04  Headphones         1  30895     CUST004   East        30895
4   2024-01-05      Laptop         8  39835     CUST005  North       318680
..         ...         ...       ...    ...         ...    ...          ...
95  2024-04-05      Tablet         8  20770     CUST096  North       166160
96  2024-04-06  Headphones         1   7647     CUST097   West         7647
97  2024-04-07      Tablet         5  27196     CUST098   East       135980
98  2024-04-08     Monitor         1  30717     CUST099  North        30717
99  2024-04-09  Headphones         5  23376     CUST100  South       116880

[100 rows x 7 columns]

In [9]:
df.drop_duplicates()

          Date     Product  Quantity  Price Customer_ID Region  Total_Sales
0   2024-01-01       Phone         7  37300     CUST001   East       261100
1   2024-01-02  Headphones         4  15406     CUST002  North        61624
2   2024-01-03       Phone         2  21746     CUST003   West        43492
3   2024-01-04  Headphones         1  30895     CUST004   East        30895
4   2024-01-05      Laptop         8  39835     CUST005  North       318680
..         ...         ...       ...    ...         ...    ...          ...
95  2024-04-05      Tablet         8  20770     CUST096  North       166160
96  2024-04-06  Headphones         1   7647     CUST097   West         7647
97  2024-04-07      Tablet         5  27196     CUST098   East       135980
98  2024-04-08     Monitor         1  30717     CUST099  North        30717
99  2024-04-09  Headphones         5  23376     CUST100  South       116880

[100 rows x 7 columns]

calculating revenue

In [20]:
df['Revenue'] = df['Quantity'] * df['Price']
df = df.drop('Total_Sales', axis=1)
df.head()

         Date     Product  Quantity  Price Customer_ID Region  Revenue
0  2024-01-01       Phone         7  37300     CUST001   East   261100
1  2024-01-02  Headphones         4  15406     CUST002  North    61624
2  2024-01-03       Phone         2  21746     CUST003   West    43492
3  2024-01-04  Headphones         1  30895     CUST004   East    30895
4  2024-01-05      Laptop         8  39835     CUST005  North   318680

Find best product

In [24]:
product_revenue = df.groupby('Product')['Revenue'].sum()
print(product_revenue)
best_product = product_revenue.idxmax()
best_revenue = product_revenue.max()
print(f"The product with the highest total revenue is: {best_product} with revenue of {product_revenue.max()}")

Product
Headphones    1384033
Laptop        3889210
Monitor       1348071
Phone         2859394
Tablet        2884340
Name: Revenue, dtype: int64
The product with the highest total revenue is: Laptop with revenue of 3889210

Format Output and a adding insights

In [26]:
print(f"Best Product: {best_product}")
print(f"Total Revenue: {best_revenue:,.2f}")

# Adding an insight
if best_revenue > 100000:
    print("Insight: This product is a top performer and contributes significantly to overall sales.")
else:
    print("Insight: While this product leads, there is room to boost its sales further.")

Best Product: Laptop
Total Revenue: 3,889,210.00
Insight: This product is a top performer and contributes significantly to overall sales.